full_stack/app/controllers/herb_controller.rb

SELECT "herbs".* FROM "herbs"
---
  def index
    @herbs = Herb.all

SELECT "herbs".* FROM "herbs" WHERE "herbs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @herb = Herb.find(params[:id])

INSERT INTO "herbs" ("name", "is_watered", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Mint"], ["is_watered", "yes"], ["created_at", "2021-03-17 17:43:59.342829"], ["updated_at", "2021-03-17 17:43:59.342829"]]
---
  def create
    @herb = Herb.create(herb_params)

SELECT "herbs".* FROM "herbs" WHERE "herbs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "herbs" WHERE "herbs"."id" = $1  [["id", 5]]
---
  def destroy
    @herb = Herb.find(params[:id])
    if @herb.destroy

SELECT "herbs".* FROM "herbs" WHERE "herbs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @herb = Herb.find(params[:id])

SELECT "herbs".* FROM "herbs" WHERE "herbs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "herbs" SET "is_watered" = $1, "updated_at" = $2 WHERE "herbs"."id" = $3  [["is_watered", "yes"], ["updated_at", "2021-03-17 18:29:10.692281"], ["id", 3]]
---
  def update
    @herb = Herb.find(params[:id])
    @herb.update(herb_params)