api_example/app/controllers/students_controller.rb

  def index
    students = Student.all
---
SELECT "students".* FROM "students"

  def show
    student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    student = Student.create(student_params)
---
INSERT INTO "students" ("name", "cohort", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Rachael"], ["cohort", "Charlie"], ["created_at", "2021-03-18 17:08:19.571212"], ["updated_at", "2021-03-18 17:08:19.571212"]]

  def destroy
    student = Student.find(params[:id])
    if student.destroy
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 5]]

  def update
    student = Student.find(params[:id])
    student.update(student_params)
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "cohort" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["cohort", "Delta"], ["updated_at", "2021-03-18 17:28:49.696709"], ["id", 4]]